// Напишите программу, которая принимает на вход число и выдает количество цифр в числе

void Length (int a)
{
    string num = a.ToString();
    Console.WriteLine (num.Length);
}
Length(1670);