//Напишите программу, которая на вход принимает число и выдает его квадрат ( Число умноженное само на себя).

Console.WriteLine("Write on number: ");
string s_a = Console.ReadLine();

int a = int.Parse(s_a);
Console.WriteLine(a * a);


// Сокрашаем написания 
// Console.WriteLine("Write on number: ");

// int a = int.Parse(Console.ReadLine());
// Console.WriteLine(a * a);
